cf/acc/1.2.2.56/Catalogs/Конфигурации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Конфигурации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЗапускаПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВОтчетность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоОбычныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаКонфигурацию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьОбъектыСПрефиксомУдалить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьОшибкиВСППР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьОтветственныхЗаМетаданныеИзСППР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьОшибкиПоОтветственному</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГруппировокСППР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКонфигурацииСППР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонфигурацииСППР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнениеКТекстуОшибкиСППР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПроверкиВручную</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоБиблиотека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьРассылкуРезультатовПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОсобенностиПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуВыгрузкиОсобенностей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеВыгрузкиОсобенностей</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательВыгрузкиОсобенностей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыгрузкиОсобенностей</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяПроверкаПоДополнительнымТребованиям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьАвтораОсобенности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>0 - Конфигурация, 1 - Расширения, 2 - Конфигурация и расширения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАктивностьРасписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВариантПроверкиПоРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВремяЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПользовательПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРасписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРегистрироватьВсеОшибкиКакОсобенностиПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьШаблонПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсключенияБезПривязки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсключенияИзПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИсключения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыИсключенийИзПроверки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Расширения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Библиотеки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БиблиотечнаяКонфигурация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричиныОсобенностей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаОсобенности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОсобенности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АктивностьРасписания</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантПроверкиПоРасписанию</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыПроверки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантПроверкиПоРасписаниюСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяЗапуска</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расписание</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрироватьВсеОшибкиКакОсобенностиПоРасписанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонПисьмаОтветственному</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонПисьмаРазработчику</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонТемыПисьмаОтветственному</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонТемыПисьмаРазработчику</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расширения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Расширения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/acc/1.2.2.56/Catalogs/Конфигурации/Ext/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ЭтоКопия Экспорт;    // Флаг копирования объекта.
Перем ОбъектКопия Экспорт; // Содержит ссылку на источник копирования.

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтоКопия = Истина;
	ОбъектКопия = ОбъектКопирования.Ссылка;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоКопия Тогда
		СкопироватьКонфигурацию(ОбъектКопия, Ссылка);
		ЭтоКопия = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КопированиеКонфигурации

Процедура СкопироватьКонфигурацию(Источник, Приемник)
	
	ВерсияИсточник = НайтиПоследнююВерсию(Источник, Ложь);
	Если ЗначениеЗаполнено(ВерсияИсточник) Тогда
		ВерсияПриемник = СкопироватьВерсиюКонфигурации(Источник, Приемник, ВерсияИсточник);
		СкопироватьСтруктуруКонфигурации(ВерсияИсточник, ВерсияПриемник);
		
		СкопироватьРасширенияКонфигурации(ВерсияИсточник, ВерсияПриемник);
		
		ТаблицаНомеровОшибок = СкопироватьОшибкиКонфигурации(ВерсияИсточник, ВерсияПриемник);
		СкопироватьКомментарииНайденныхОшибок(ТаблицаНомеровОшибок);
		
	Иначе
		Сообщить(НСтр("ru='Не найдено ни одной версии конфигурации-источника.'") + " "
			+ НСтр("ru='Версия и структура конфигурации не будут скопированы.'"));
	КонецЕсли;
	
КонецПроцедуры

Функция СкопироватьВерсиюКонфигурации(Источник, Приемник, ВерсияИсточник)
	
	МассивСвойствДляИсключения = Новый Массив;
	МассивСвойствДляИсключения.Добавить("Владелец");
	МассивСвойствДляИсключения.Добавить("Родитель");
	
	СвойстваДляИсключения = СтрСоединить(МассивСвойствДляИсключения, ", ");
	
	НовыйЭлемент = Справочники.Версии.СоздатьЭлемент();
	НовыйЭлемент.Владелец = Приемник;
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ВерсияИсточник,, СвойстваДляИсключения);
	
	Для Каждого СтрокаСобранныеДанные Из ВерсияИсточник.СобранныеДанные Цикл
		ЗаполнитьЗначенияСвойств(НовыйЭлемент.СобранныеДанные.Добавить(), СтрокаСобранныеДанные);
	КонецЦикла;
	
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

Процедура СкопироватьРасширенияКонфигурации(ВерсияИсточник, ВерсияПриемник)
	
	Расширения.Очистить();
	
	МассивСвойствДляИсключения = Новый Массив;
	МассивСвойствДляИсключения.Добавить("Владелец");
	МассивСвойствДляИсключения.Добавить("Родитель");
	
	Источник = ВерсияИсточник.Владелец;
	Приемник = ВерсияПриемник.Владелец;
	
	СвойстваДляИсключения = СтрСоединить(МассивСвойствДляИсключения, ", ");
	
	Выборка = Справочники.Расширения.Выбрать(, Источник);
	Пока Выборка.Следующий() Цикл
		
		РасширениеИсточник = Выборка.Ссылка;
		
		Если РасширениеИсточник.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлемент = Справочники.Расширения.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, РасширениеИсточник,, СвойстваДляИсключения);
		НовыйЭлемент.Владелец = Приемник;
		НовыйЭлемент.Наименование = РасширениеИсточник.Наименование;
		НовыйЭлемент.Записать();
		
		Если Приемник.Расширения.Найти(РасширениеИсточник) <> Неопределено Тогда
			НоваяСтрока = Расширения.Добавить();
			НоваяСтрока.Расширение = НовыйЭлемент.Ссылка;
		КонецЕсли;
		
		СкопироватьСтруктуруКонфигурации(ВерсияИсточник, ВерсияПриемник, РасширениеИсточник, НовыйЭлемент.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьПодсистемыОбъекта(ОбъектИсточник, ОбъектПриемник)
	
	Для Каждого ПодсистемаИсточник Из ОбъектИсточник.Подсистемы Цикл
		
		ПодсистемаПуть = ПодсистемаИсточник.Подсистема.Путь;
		ВерсияПриемник = ОбъектПриемник.Владелец;
		ПодсистемаСсылка = Справочники.СтруктураКонфигурации.НайтиПоРеквизиту("Путь", ПодсистемаПуть,, ВерсияПриемник);
		
		ПодсистемаПриемник = ОбъектПриемник.Подсистемы.Добавить();
		ПодсистемаПриемник.Подсистема = ПодсистемаСсылка;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьСтруктуруКонфигурации(ВерсияИсточник, ВерсияПриемник, РасширениеИсточник = Неопределено,
	РасширениеПриемник = Неопределено)
	
	РасширениеПриемникСсылка = ПолучитьСсылкуРасширения(РасширениеПриемник);
	РасширениеИсточникСсылка = ПолучитьСсылкуРасширения(РасширениеИсточник);
	ОписаниеКонфигурацииИлиРасширения = ПолучитьОписаниеКонфигурацииИлиРасширения(РасширениеИсточникСсылка);
	
	ЗапросПоОбъектам = Новый Запрос;
	ЗапросПоОбъектам.Текст = "
	|ВЫБРАТЬ
	|	СтруктураКонфигурации.Ссылка
	|ИЗ
	|	Справочник.СтруктураКонфигурации КАК СтруктураКонфигурации
	|ГДЕ
	|	СтруктураКонфигурации.Владелец = &Владелец
	|	И СтруктураКонфигурации.Расширение = &Расширение
	|	И НЕ СтруктураКонфигурации.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтруктураКонфигурации.НомерПоПорядку";
		
	ЗапросПоОбъектам.УстановитьПараметр("Владелец", ВерсияИсточник);
	ЗапросПоОбъектам.УстановитьПараметр("Расширение", РасширениеИсточникСсылка);
	
	Выборка = ЗапросПоОбъектам.Выполнить().Выбрать();
	НомерОбъекта = 0;
	ВсегоОбъектов = Выборка.Количество();
	
	ШаблонаТекстаСостояния = СтрШаблон(НСтр("ru='Выполняется запись структуры %1'"), ОписаниеКонфигурацииИлиРасширения);;
	ШаблонаТекстаСостояния = ШаблонаТекстаСостояния + " (%1%%)";
	
	#Если Клиент Тогда
	Состояние(СтрШаблон(ШаблонаТекстаСостояния, "0"));
	#КонецЕсли
	
	ПроцентОбработанныхОбъектов = 0;
	
	Пока Выборка.Следующий() Цикл
		
		СсылкаИсточник = Выборка.Ссылка;
		ОбъектПриемник = Справочники.СтруктураКонфигурации.СоздатьЭлемент();
		
		ЗаполнитьЗначенияСвойств(ОбъектПриемник, СсылкаИсточник,, "Владелец, Родитель, Код, Расширение");
		
		РодительПуть = Выборка.Ссылка.Родитель.Путь;
		РодительСсылка = Справочники.СтруктураКонфигурации.НайтиПоРеквизиту("Путь", РодительПуть,, ВерсияПриемник);
		ОбъектПриемник.Родитель = РодительСсылка;
		ОбъектПриемник.Владелец = ВерсияПриемник;
		ОбъектПриемник.Расширение = РасширениеПриемникСсылка;
		
		СкопироватьПодсистемыОбъекта(СсылкаИсточник, ОбъектПриемник);
		
		ЭлементЗаписан = Ложь;
		СчетчикТранзакций = 1;
		
		Пока (НЕ ЭлементЗаписан) И (СчетчикТранзакций < 1000) Цикл
			ЭлементЗаписан = Истина;
			Попытка
				ОбъектПриемник.Записать();
			Исключение
				ЭлементЗаписан = Ложь;
				Сообщить("Ошибка!");
			КонецПопытки;
			СчетчикТранзакций = СчетчикТранзакций + 1;
		КонецЦикла;
		
		НомерОбъекта = НомерОбъекта + 1;
		
		#Если Клиент Тогда
		ТекущийПроцентОбъектов = Цел(100 * НомерОбъекта / ВсегоОбъектов);
		
		Если ТекущийПроцентОбъектов > ПроцентОбработанныхОбъектов Тогда
			ПроцентОбработанныхОбъектов = ТекущийПроцентОбъектов;
			ТекстСостояния = СтрШаблон(ШаблонаТекстаСостояния, Строка(ТекущийПроцентОбъектов));
			Состояние(ТекстСостояния);
		КонецЕсли;
		#КонецЕсли
		
	КонецЦикла;
	
	#Если Клиент Тогда
	Состояние("");
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Инициализация

ЭтоКопия = Ложь;

#КонецОбласти

#КонецЕсли
